# define _CRT_SECURE_NO_WARNINGS
#include   "iostream"
# include  "windows.h"
#include   <TlHelp32.h>
#include   "Pe.h"


//【封装函数】Align:对齐计算函数
//【参数1】size：对齐前的大小
//【参数2】ALIGN_BASE：对齐的粒度
//【返回值】DWORD：对齐后的大小
DWORD Align(IN DWORD size, IN DWORD ALIGN_BASE)
{
	if (size % ALIGN_BASE != 0)
	{
		size = (size / ALIGN_BASE + 1) * ALIGN_BASE;
	}
	return size;
}


//【封装函数】FileToBuffer：读取硬盘文件到文件缓存
//【参数1】FilePath：读取的硬盘文件的路径名  //一级指针
//【参数2】FileSize：指向“读取的文件大小”的指针  //一级指针
//【参数3】pFileBuffer:指向“文件缓存指针”的指针  //二级指针
//【返回值】BOOL ：成功返回TRUE，失败返回FALSE
BOOL FileToBuffer(IN PCHAR FilePath, OUT DWORD* FileSize, OUT PCHAR* pFileBuffer)
{
	//1.打开文件名
	FILE* pFile = fopen(FilePath, "rb");
	if (!pFile)
	{
		printf("打开文件失败！ \r\n");
		return FALSE;
	}

	//2.获取文件大小
	fseek(pFile, 0, SEEK_END);
	DWORD Size = ftell(pFile);
	fseek(pFile, 0, SEEK_SET);

	//3.分配内存空间
	*pFileBuffer = (PCHAR)malloc(Size);
	if (!*pFileBuffer)
	{
		printf("分配空间失败!");
		fclose(pFile);
		return FALSE;
	}

	//4.读取文件到文件缓存中
	if (!fread(*pFileBuffer, Size, 1, pFile))
	{
		printf("读取数据失败!");
		free(*pFileBuffer);
		fclose(pFile);
		return FALSE;
	}

	//5.关闭文件名
	fclose(pFile);

	*FileSize = Size;

	return TRUE;
}


//【封装函数】RvaToFoa:将Rva转换为Foa
//【参数1】pFileBuffer:文件缓存指针 //一级指针
//【参数2】RVA:相对内存偏移 
//【返回值】DWORD：相对文件偏移FOA
DWORD RvaToFoa(IN PCHAR pFileBuffer, IN DWORD RVA)
{
	//-------------------------------1.定位PE结构各种基址------------------------------------	
	//1.获取DOS头基址
	PIMAGE_DOS_HEADER pDosHeader_Base = (PIMAGE_DOS_HEADER)pFileBuffer;

	PIMAGE_EXPORT_DIRECTORY ExportBase = (PIMAGE_EXPORT_DIRECTORY)g_Exp;
	LPDWORD pAddFunc = (LPDWORD)((DWORD)pImageBuffer + ExportBase->AddressOfFunctions);
	LPDWORD pAddName = (LPDWORD)((DWORD)pImageBuffer + ExportBase->AddressOfNames);
	LPWORD pAddOrdi = (LPWORD)((DWORD)pImageBuffer + ExportBase->AddressOfNameOrdinals);

	//2.遍历DLL的导出表获取函数的真正地址
	for (size_t i = 0; i < ExportBase->NumberOfNames; i++)
	{
		//1.获得名称表里的某一项：（函数名的RVA）
		DWORD pname_RVA = pAddName[i];
		//2.获得名称表里的某一项在镜像缓存中的基址（基址里面存放的是函数名字符串）
		PCHAR pname_Base = PCHAR((PUCHAR)pImageBuffer + pname_RVA);
		//3.对比传进来的函数名与名称表里的函数名
		if (strcmp(szName, pname_Base) == 0)
		{
			//注意：3张表的顺序是名称表-->序号表--->地址表
			//注意：名称表内的值是RVA，序号表内的值是序号，地址表内的值是RVA
			//注意：名称表内的函数名称一旦对比相同，就要把当前下标作为序号表的下标，找序号表相同下标的项的值
			//注意：序号表的项的值作为下标去地址表内查找，那一项的内容就是函数地址（RVA）

			//1.拿着当前下标去序号表里找相同下标的项
			DWORD pnumber = pAddOrdi[i];
			//2.把序号表里拿到的这一项的内容作为下标去地址表里查
			DWORD pAdd = pAddFunc[pnumber];
			//3.地址表里查到的值+ImageBase为真正函数地址
			PVOID funcadd = PVOID((PUCHAR)pImageBuffer + pAdd);
			//4.将真正函数地址作为返回值传递出去
			return funcadd;
		}
	}
	return NULL;
}

//【封装函数】MemGetFunctionAddrByOrdinals：通过导出函数序号查找函数地址（针对的是断链抹除PE指纹的DLL）
//【参数1】pImageBuffer:镜像缓存指针  //一级指针
//【参数2】dwOrdinal：函数序号
//【参数3】g_Exp :导出表基址（断链抹除PE指纹之前保存过的一个全局变量）
//【返回值】函数的地址
PVOID MemGetFunctionAddrByOrdinals(PCHAR pImageBuffer, DWORD dwOrdinal, IN PCHAR g_Exp)
{
	//1.定位地址表,名称表,序号表
	PIMAGE_EXPORT_DIRECTORY ExportBase = (PIMAGE_EXPORT_DIRECTORY)g_Exp;
	LPDWORD pAddFunc = (LPDWORD)(pImageBuffer + ExportBase->AddressOfFunctions);
	//2.判断序号是否有效
	if (dwOrdinal - ExportBase->Base > ExportBase->NumberOfFunctions)
	{
		return NULL;
	}
	//3.用序号减去序号的base，差值作为下标去地址表内查找
	DWORD pAdd = pAddFunc[dwOrdinal - ExportBase->Base];
	//4.地址表里查到的值+ImageBase为真正函数地址
	PVOID funcadd = PVOID((PUCHAR)pImageBuffer + pAdd);
	//5.将真正函数地址作为返回值传递出去
	return funcadd;
}


//【封装函数】ClaenPeInfo:抹除PE指纹
//【参数1】pImageBuffer:镜像缓存指针  //一级指针
//【参数2】g_Exp:指向“导出表基址”的指针  //二级指针
VOID ClaenPeInfo(IN PCHAR pImageBuffer,OUT PCHAR* g_Exp)
{
	//--------------------------1.定位PE结构各种基址---------------------------------------------
	//1.获取DOS头基址
	PIMAGE_DOS_HEADER pDosHeader_Base = (PIMAGE_DOS_HEADER)pImageBuffer;
	//2.获取NT头基址
	PIMAGE_NT_HEADERS pNTHeader_Base = PIMAGE_NT_HEADERS((PUCHAR)pImageBuffer + pDosHeader_Base->e_lfanew);
	//3.获取文件头基址
	PIMAGE_FILE_HEADER pFileHeader_Base = (PIMAGE_FILE_HEADER)((PUCHAR)pNTHeader_Base + 4);
	//4.获取可选头基址	
	PIMAGE_OPTIONAL_HEADER pOptionHeader_Base = (PIMAGE_OPTIONAL_HEADER)((PUCHAR)pFileHeader_Base + sizeof(IMAGE_FILE_HEADER));

	//-------------------------2.备份导出表的基址（后面调用导出表内的函数要用到）--------------------------------
	*g_Exp = PCHAR((PUCHAR)pImageBuffer + pOptionHeader_Base->DataDirectory[IMAGE_DIRECTORY_ENTRY_EXPORT].VirtualAddress);

	//--------------------------------------3.抹除PE头--------------------------------------------------------
	memset(pImageBuffer, 0, pOptionHeader_Base->SectionAlignment);
}

//-----------------------------------------------------------------------------------------------------------------
//1.定义结构体UNICODE_STRING
typedef struct _UNICODE_STRING
{
	USHORT Length;                                                          //0x0
	USHORT MaximumLength;                                                   //0x2
	WCHAR* Buffer;                                                          //0x4
}UNICODE_STRING, *PUNICODE_STRING;
//2.定义结构体PEB_LDR_DATA
typedef struct _PEB_LDR_DATA
{
	ULONG Length;                                                           //0x0
	UCHAR Initialized;                                                      //0x4
	VOID* SsHandle;                                                         //0x8
	struct _LIST_ENTRY InLoadOrderModuleList;                               //0xc
	struct _LIST_ENTRY InMemoryOrderModuleList;                             //0x14
	struct _LIST_ENTRY InInitializationOrderModuleList;                     //0x1c
	VOID* EntryInProgress;                                                  //0x24
	UCHAR ShutdownInProgress;                                               //0x28
	VOID* ShutdownThreadId;                                                 //0x2c
}PEB_LDR_DATA, *PPEB_LDR_DATA;
//3.定义结构体LDR_DATA_TABLE_ENTRY
typedef struct _LDR_DATA_TABLE_ENTRY
{
	struct _LIST_ENTRY InLoadOrderLinks;                                    //0x0
	struct _LIST_ENTRY InMemoryOrderLinks;                                  //0x8
	struct _LIST_ENTRY InInitializationOrderLinks;                          //0x10
	VOID* DllBase;                                                          //0x18
	VOID* EntryPoint;                                                       //0x1c
	ULONG SizeOfImage;                                                      //0x20
	struct _UNICODE_STRING FullDllName;                                     //0x24
	struct _UNICODE_STRING BaseDllName;                                     //0x2c
}LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;

//【封装函数】HideModule：隐藏模块
//【参数1】szModuleName：模块名
VOID HideModule(PCHAR szModuleName)
{
	//注意：TEB-->PEB-->PEB_LDR_DATA-->PLDR_DATA_TABLE_ENTRY-->PLIST_ENTRY
	//--------------------------------1.获取各种基址---------------------------------------------
	//1.获得传进来的模块名的模块基址
	HMODULE hMod = GetModuleHandleA(szModuleName);
	//2.获取PEB_LDR_DATA的基址
	PPEB_LDR_DATA pLdr_Base = NULL;
	__asm
	{
		MOV EAX, FS: [0x30]
		MOV EAX, [EAX + 0xC]
		MOV pLdr_Base, EAX
	}
	//3.获取PEB_LDR_DATA中的成员InLoadOrderModuleList的地址
	//注意：InLoadOrderModuleList是大结构体PEB_LDR_DATA中的嵌套结构体
	//先用pLdr_Base->InLoadOrderModuleList取得InLoadOrderModuleList结构体，然后用&(pLdr_Base->InLoadOrderModuleList)取得InLoadOrderModuleList的基址
	PLIST_ENTRY pInLoadOrderModuleList_Base = &(pLdr_Base->InLoadOrderModuleList);
	//4.把结构体InLoadOrderModuleList中的成员Flink指向的指针作为第一个双向链表的基址
